app/controllers/users_controller.rb

  def create

    @user = User.new
    puts "<====>"
    puts params
    puts "<====>"
    @user.username = params[:username]
    @user.email = params[:email]
    @user.bio = params[:bio]
    @user.save
---
INSERT INTO "users" ("username", "email", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "q^pvcmlv"], ["email", "fgg@galg.df"], ["bio", "gdfùvml"], ["created_at", "2018-07-31 14:50:08.230670"], ["updated_at", "2018-07-31 14:50:08.230670"]]